/* Напишете програма, която изчислява разходите за ремонта, предвид следните цени:
· Предпазен найлон - 1.50 лв. за кв. метър
· Боя - 14.50 лв. за литър
· Разредител за боя - 5.00 лв. за литър 
За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон, разбира се и 0.40 лв. за торбички. 
Сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от сбора на всички разходи за материали.
Входът се чете от конзолата и съдържа точно 4 реда:
1. Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
2. Необходимо количество боя (в литри) - цяло число в интервала [1…100]
3. Количество разредител (в литри) - цяло число в интервала [1…30]
4. Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]*/

function repainting(input) {
  let naylon = (Number(input[0]) + 2) * 1.5;
  let paint = Number(input[1]);
  let paint2 = paint * 0.1;
  let allPaint = (paint + paint2) * 14.5;
  let diluent = Number(input[2]) * 5;
  let hoursWork = Number(input[3]);
  let materialsSum = naylon + allPaint + diluent + 0.4;
  let workersPayment = materialsSum * 0.3 * hoursWork;
  let repaintingSum = materialsSum + workersPayment;
  console.log(repaintingSum);
}

repainting(input); // 727.09
